# PANDAS: BASICS
Series: One D 
Dataframe: Two D

In [8]:
import pandas as pd

In [7]:
#check pandas version
print(pd.__version__)

1.5.3

## Series create,manipulate,query,delete

In [10]:
#creating a series from a list
arr=[25,36,44,98]
s1=pd.Series(arr)
s1

0    25
1    36
2    44
3    98
dtype: int64

In [13]:
#giving a order
order=[1,2,3,4]
s2=pd.Series(arr,index=order)
s2

1    25
2    36
3    44
4    98
dtype: int64

In [19]:
#Creating series from a numpy array
import numpy as np
n=np.random.randn(4) #create a rando Ndarray
n
Order=['a','b','c','d']
s2=pd.Series(n,index=Order)
s2

a   -0.853261
b    0.871828
c   -0.063919
d   -1.390937
dtype: float64

In [24]:
#from a dictionary
d={'a':1,'b':2,'c':3,'d':4}
d
s3=pd.Series(d)
s3

a    1
b    2
c    3
d    4
dtype: int64

In [27]:
#modifying the index of the series
print(s1)
s1.index=['A','B','C','D']
s1

A    25
B    36
C    44
D    98
dtype: int64

A    25
B    36
C    44
D    98
dtype: int64

In [30]:
#slicing: just viewing, doesnt change
s1[1:3]

B    36
C    44
dtype: int64

https://youtu.be/FniLzpaSFGk?t=5674

In [1]:
import pandas as pd
pd.__version__

'2.0.3'

In [2]:
A=pd.Series([1,2,3])
A

0    1
1    2
2    3
dtype: int64

In [3]:
B=pd.Series({'a':1.0,'b':2.3,'c':4.5})
L=pd.concat([A,B])
L

0    1.0
1    2.0
2    3.0
a    1.0
b    2.3
c    4.5
dtype: float64

In [4]:
A = pd.Series([1, 2, 3])
K = pd.Series([4, 5, 6])
C=pd.concat([A,K])
C

0    1
1    2
2    3
0    4
1    5
2    6
dtype: int64

In [24]:
C.drop([2])

KeyError: '[2] not found in axis'

## Series Operation

In [5]:
import pandas as pd

In [6]:
s1=pd.Series([1,2,3,4])
s2=pd.Series([5,6,7,8,9])
s2.add(s1)

0     6.0
1     8.0
2    10.0
3    12.0
4     NaN
dtype: float64

In [7]:
print('median',s2.median())
print('max',s2.max()) 
print('min',s2.min())

median 7.0
max 9
min 5

## Create a dataframe

In [18]:
import random
import numpy as np
import pandas as pd
dates=pd.date_range('today',periods=6) #define time sequence as index
dates

DatetimeIndex(['2023-08-04 21:45:01.890504', '2023-08-05 21:45:01.890504',
               '2023-08-06 21:45:01.890504', '2023-08-07 21:45:01.890504',
               '2023-08-08 21:45:01.890504', '2023-08-09 21:45:01.890504'],
              dtype='datetime64[ns]', freq='D')

In [19]:
num_arr=np.random.randn(6,4)
columns =['A','B','C','D']

df1=pd.DataFrame(num_arr,index=dates,columns=columns)
df1

                                   A         B         C         D
2023-08-04 21:45:01.890504 -0.547011  0.918491  0.346213 -0.678575
2023-08-05 21:45:01.890504  0.916614  0.077732 -1.300589  0.646955
2023-08-06 21:45:01.890504 -1.185389  1.072694 -0.380194  0.661930
2023-08-07 21:45:01.890504 -0.769184 -1.290732  1.330162 -0.279215
2023-08-08 21:45:01.890504  2.268374  1.995998 -0.441087  1.566416
2023-08-09 21:45:01.890504  1.546491 -1.164963  1.089176  0.026785

In [32]:
#create dataframe with dictionary array
data= {
    'animal':['cat','cat','snake','snake','dog','dog','cat','dog','dog'],
    'age':[2.5,3,0.5,np.nan,7,3,8,9,1],
    'visits':np.random.randint(5,size=9)
}
labels=['A','B','C','D','E','F','G','H','I']
dataframe=pd.DataFrame(data,index=labels)
dataframe1=pd.DataFrame(data,index=labels)
dataframe

  animal  age  visits
A    cat  2.5       3
B    cat  3.0       4
C  snake  0.5       2
D  snake  NaN       1
E    dog  7.0       2
F    dog  3.0       0
G    cat  8.0       3
H    dog  9.0       1
I    dog  1.0       3

In [33]:
 dataframe1

  animal  age  visits
A    cat  2.5       3
B    cat  3.0       4
C  snake  0.5       2
D  snake  NaN       1
E    dog  7.0       2
F    dog  3.0       0
G    cat  8.0       3
H    dog  9.0       1
I    dog  1.0       3

In [35]:
dataframe.head()

  animal  age  visits
A    cat  2.5       3
B    cat  3.0       4
C  snake  0.5       2
D  snake  NaN       1
E    dog  7.0       2

In [36]:
dataframe.tail()

  animal  age  visits
E    dog  7.0       2
F    dog  3.0       0
G    cat  8.0       3
H    dog  9.0       1
I    dog  1.0       3

In [86]:
dataframe.index.dtype

dtype('O')

In [87]:
df1.index.dtype

dtype('<M8[ns]')

In [50]:
df1.values

array([[-0.54701111,  0.91849114,  0.34621319, -0.67857522],
       [ 0.91661409,  0.07773246, -1.30058865,  0.64695546],
       [-1.18538862,  1.07269367, -0.38019437,  0.6619297 ],
       [-0.76918384, -1.2907323 ,  1.33016237, -0.27921471],
       [ 2.26837391,  1.99599774, -0.44108728,  1.56641599],
       [ 1.54649069, -1.16496316,  1.08917601,  0.02678478]])

In [53]:
dataframe.values

array([['cat', 2.5, 3],
       ['cat', 3.0, 4],
       ['snake', 0.5, 2],
       ['snake', nan, 1],
       ['dog', 7.0, 2],
       ['dog', 3.0, 0],
       ['cat', 8.0, 3],
       ['dog', 9.0, 1],
       ['dog', 1.0, 3]], dtype=object)

In [57]:
df1.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.371649  0.268203  0.107280  0.324049
std    1.403183  1.309647  1.003701  0.802428
min   -1.185389 -1.290732 -1.300589 -0.678575
25%   -0.713641 -0.854289 -0.425864 -0.202715
50%    0.184801  0.498112 -0.016991  0.336870
75%    1.389022  1.034143  0.903435  0.658186
max    2.268374  1.995998  1.330162  1.566416

In [59]:
dataframe.T #transposes the dataframe, index and columns are interchanged

          A    B      C      D    E    F    G    H    I
animal  cat  cat  snake  snake  dog  dog  cat  dog  dog
age     2.5  3.0    0.5    NaN  7.0  3.0  8.0  9.0  1.0
visits    3    4      2      1    2    0    3    1    3

In [60]:
dataframe.sort_values(by='age') #even indexes are moves

  animal  age  visits
C  snake  0.5       2
I    dog  1.0       3
A    cat  2.5       3
B    cat  3.0       4
F    dog  3.0       0
E    dog  7.0       2
G    cat  8.0       3
H    dog  9.0       1
D  snake  NaN       1

In [61]:
df1[1:3]  #returns another dataframe

                                   A         B         C         D
2023-08-05 21:45:01.890504  0.916614  0.077732 -1.300589  0.646955
2023-08-06 21:45:01.890504 -1.185389  1.072694 -0.380194  0.661930

In [73]:
#query dataframe by tag
print(dataframe[1:3][['age','visits']])
dataframe[['age','visits']]

   age  visits
B  3.0       4
C  0.5       2

   age  visits
A  2.5       3
B  3.0       4
C  0.5       2
D  NaN       1
E  7.0       2
F  3.0       0
G  8.0       3
H  9.0       1
I  1.0       3

In [74]:
dataframe.isnull()

   animal    age  visits
A   False  False   False
B   False  False   False
C   False  False   False
D   False   True   False
E   False  False   False
F   False  False   False
G   False  False   False
H   False  False   False
I   False  False   False

In [83]:
dataframe.loc['F','age']=1.5
dataframe

  animal  age  visits
A    cat  2.5       3
B    cat  3.0       4
C  snake  0.5       2
D  snake  5.0       1
E    dog  7.0       2
F    dog  1.5       0
G    cat  8.0       3
H    dog  9.0       1
I    dog  1.0       3

In [82]:
dataframe.loc['D','age']=5